# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
data_url = r"https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
users = pd.read_csv(data_url, sep="|", index_col="user_id")

### Step 4. See the first 25 entries

In [4]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [5]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [6]:
# 1st Way
users.shape[0]

943

In [7]:
# 2nd Way
users.info(verbose=False)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Columns: 4 entries, age to zip_code
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 7. What is the number of columns in the dataset?

In [8]:
# 1st way
users.shape[1]

4

In [9]:
# 2nd way
len(users.columns)

4

### Step 8. Print the name of all the columns.

In [10]:
print(users.columns.to_list())

['age', 'gender', 'occupation', 'zip_code']

### Step 9. How is the dataset indexed?

In [11]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [12]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [13]:
users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [14]:
users["occupation"].nunique()

21

### Step 13. What is the most frequent occupation?

In [15]:
users["occupation"].value_counts().head(1)

student    196
Name: occupation, dtype: int64

### Step 14. Summarize the DataFrame.

In [16]:
# Describe Only The Numerical Columns
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## Step 15. Summarize all the columns

### Summarize Age Columns

In [17]:
users["age"].describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

### Summarize Gender Columns

In [18]:
users["gender"].describe()

count     943
unique      2
top         M
freq      670
Name: gender, dtype: object

In [19]:
# Percentage of Gender
users["gender"].value_counts(normalize=True)*100

M    71.049841
F    28.950159
Name: gender, dtype: float64

### Summarize Occupation Columns

In [20]:
users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [21]:
# Percentage of Occupation
users["occupation"].value_counts(normalize=True)*100

student          20.784730
other            11.134677
educator         10.074231
administrator     8.377519
engineer          7.104984
programmer        6.998940
librarian         5.408271
writer            4.772004
executive         3.393425
scientist         3.287381
artist            2.969247
technician        2.863203
marketing         2.757158
entertainment     1.908802
healthcare        1.696713
retired           1.484624
lawyer            1.272534
salesman          1.272534
none              0.954401
homemaker         0.742312
doctor            0.742312
Name: occupation, dtype: float64

#### Summarize Zib_code Columns

##### Additional: Get a CSV of Country By Zipcode

In [22]:
# CSV File With Zibcode and its city, Country
zib_code_list = pd.read_csv("https://raw.githubusercontent.com/scpike/us-state-county-zip/master/geo-data.csv")

In [23]:
# Get Only Specific Columns From DF
zib_code_list = zib_code_list.loc[:, ["zipcode", "state", "county", "city"]]

In [24]:
# Merge 2 DF Together [users, zib_code_list] by Zibcode column
merged_users_zipcode = pd.merge(users, zib_code_list, left_on="zip_code", right_on="zipcode")
merged_users_zipcode.head()

,age,gender,occupation,zip_code,zipcode,state,county,city
0,24,M,technician,85711,85711,Arizona,Pima,Tucson
1,39,M,educator,85711,85711,Arizona,Pima,Tucson
2,53,F,other,94043,94043,California,Santa Clara,Mountain view
3,41,M,programmer,94043,94043,California,Santa Clara,Mountain view
4,24,M,engineer,94043,94043,California,Santa Clara,Mountain view

In [25]:
merged_users_zipcode["county"].value_counts()

Hennepin          40
Los Angeles       31
Cook              24
Ramsey            23
New York          19
                  ..
Missoula           1
Canyon             1
Honolulu           1
San Bernardino     1
Branch             1
Name: county, Length: 295, dtype: int64

In [26]:
merged_users_zipcode.groupby("state")[["age"]].agg(['mean', 'median']).head(15)

                            age
                           mean median
state
Alabama               34.666667   31.0
Alaska                37.400000   45.0
Arizona               32.642857   31.0
Arkansas              22.000000   22.0
California            34.416667   32.0
Colorado              36.200000   32.5
Connecticut           40.000000   42.0
Delaware              25.000000   25.0
District of columbia  33.636364   28.0
Florida               34.571429   31.0
Georgia               34.157895   35.0
Hawaii                34.500000   34.5
Idaho                 33.428571   42.0
Illinois              33.959184   32.0
Indiana               28.666667   27.0

### Step 16. Summarize only the occupation column

In [27]:
users["occupation"].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [28]:
users["occupation"].value_counts(normalize=1)*100

student          20.784730
other            11.134677
educator         10.074231
administrator     8.377519
engineer          7.104984
programmer        6.998940
librarian         5.408271
writer            4.772004
executive         3.393425
scientist         3.287381
artist            2.969247
technician        2.863203
marketing         2.757158
entertainment     1.908802
healthcare        1.696713
retired           1.484624
lawyer            1.272534
salesman          1.272534
none              0.954401
homemaker         0.742312
doctor            0.742312
Name: occupation, dtype: float64

In [29]:
# Get The Median Age For Each Occupation
users.groupby("occupation")[["age"]].median()

                age
occupation
administrator  37.0
artist         30.0
doctor         45.0
educator       42.0
engineer       36.0
entertainment  25.0
executive      38.5
healthcare     44.5
homemaker      32.0
lawyer         34.0
librarian      39.0
marketing      36.0
none           26.0
other          32.0
programmer     30.0
retired        63.0
salesman       34.0
scientist      37.0
student        21.0
technician     30.0
writer         36.0

### Step 17. What is the mean age of users?

In [30]:
users["age"].mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [31]:
users["age"].value_counts().tail(1)

73    1
Name: age, dtype: int64

# Time To Discover and Groupping

### Discover what is the mean age per occupation

In [73]:
# Groupped By Occupation
occupation_goup = users.groupby("occupation")

In [74]:
round(occupation_goup[["age"]].mean())

                age
occupation
administrator  39.0
artist         31.0
doctor         44.0
educator       42.0
engineer       36.0
entertainment  29.0
executive      39.0
healthcare     42.0
homemaker      33.0
lawyer         37.0
librarian      40.0
marketing      38.0
none           27.0
other          35.0
programmer     33.0
retired        63.0
salesman       36.0
scientist      36.0
student        22.0
technician     33.0
writer         36.0

###  Discover the Male ratio per occupation and sort it from the most to the least

In [136]:
users_group = pd.Series(users[["occupation"]].value_counts(), name="all_users")

In [137]:
male_group = users[users["gender"] == "M"].groupby("occupation")["gender"].value_counts()
male_group = pd.Series(male_group, name="male_users")

In [138]:
d = pd.merge(users_group, male_group, left_on="occupation", right_on="occupation")
(d["male_users"] / d["all_users"]).sort_values(ascending=False)

occupation
doctor           1.000000
engineer         0.970149
technician       0.962963
retired          0.928571
programmer       0.909091
executive        0.906250
scientist        0.903226
entertainment    0.888889
lawyer           0.833333
salesman         0.750000
educator         0.726316
student          0.693878
other            0.657143
marketing        0.615385
writer           0.577778
none             0.555556
administrator    0.544304
artist           0.535714
librarian        0.431373
healthcare       0.312500
homemaker        0.142857
dtype: float64

###  For each occupation, calculate the minimum and maximum ages

In [140]:
users.groupby('occupation')["age"].agg(["min", "max"])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### For each combination of occupation and gender, calculate the mean age

In [147]:
users.groupby(['occupation', 'gender'])["age"].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

###  For each occupation present the percentage of women and men

In [151]:
users.groupby("occupation")["gender"].value_counts(1)*100

occupation     gender
administrator  M          54.430380
               F          45.569620
artist         M          53.571429
               F          46.428571
doctor         M         100.000000
educator       M          72.631579
               F          27.368421
engineer       M          97.014925
               F           2.985075
entertainment  M          88.888889
               F          11.111111
executive      M          90.625000
               F           9.375000
healthcare     F          68.750000
               M          31.250000
homemaker      F          85.714286
               M          14.285714
lawyer         M          83.333333
               F          16.666667
librarian      F          56.862745
               M          43.137255
marketing      M          61.538462
               F          38.461538
none           M          55.555556
               F          44.444444
other          M          65.714286
               F          34.285714
programmer     M          90.909091
               F           9.090909
retired        M          92.857143
               F           7.142857
salesman       M          75.000000
               F          25.000000
scientist      M          90.322581
               F           9.677419
student        M          69.387755
               F          30.612245
technician     M          96.296296
               F           3.703704
writer         M          57.777778
               F          42.222222
Name: gender, dtype: float64